CSI API ETABS v1
cLineElm.GetReleases Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetReleases(
	string Name,
	ref bool[] II,
	ref bool[] JJ,
	ref double[] StartValue,
	ref double[] EndValue
)
Function GetReleases (
	Name As String,
	ByRef II As Boolean(),
	ByRef JJ As Boolean(),
	ByRef StartValue As Double(),
	ByRef EndValue As Double()
) As Integer
Dim instance As cLineElm
Dim Name As String
Dim II As Boolean()
Dim JJ As Boolean()
Dim StartValue As Double()
Dim EndValue As Double()
Dim returnValue As Integer
returnValue = instance.GetReleases(Name,
	II, JJ, StartValue, EndValue)
int GetReleases(
	String^ Name,
	array<bool>^% II,
	array<bool>^% JJ,
	array<double>^% StartValue,
	array<double>^% EndValue
)
abstract GetReleases :
        Name : string *
        II : bool[] byref *
        JJ : bool[] byref *
        StartValue : float[] byref *
        EndValue : float[] byref -> int
Parameters
Name
Type: System.String
II
Type: System.Boolean[]
JJ
Type: System.Boolean[]
StartValue
Type: System.Double[]
EndValue
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cLineElm Interface
ETABSv1 Namespace